fun main() {
    val num = 1
    println(num)
}
/*
値を別な文字列へと置き換える関数

var 変数名:型 = 値
val 変数名:型 = 値

varとvalの違い
varは後で上書きすることのできる変数
valは上書き不可の変数

数値型の最大値
型	                 最小値	                   最大値
BYTE                 –128	                    127
UBYTE	               0	                    255
SHORT               –32768	                   32767
USHORT	               0	                   65535
INT	             –2147483648              	2147483647
UINT                   0	                4294967295
LONG	    -9223372036854775808	   9223372036854775807
ULONG	               0               18446744073709551615
FLOAT	     –3.4028235 x 10^38	        3.4028235 x 10^38
DOUBLE	–1.7976931348623157 x 10^308	1.7976931348623157 x 10^308

文字列型の種類
型                    種別
Char               一文字のみ
String              複数文字

ブール型
形
boolean

方は指定することが推奨されるが、Kotlinの自動形推測を利用するのもあり

*/

